#해보세요
#1.나이가 10살이상이고 150이상만 탑승가능
#나이, 키를 입력받아
#[탑승가능][탑승불가능]을 출력해보세요
#input()함수를 사용할 경우 문자열로 입력받아
#print()함수는 출력

age=int(input("나이를 입력하세요 >>> "))
height=int(input("키를 입력하세요 >>>"))

if age >=10 and height>=150:
    print("탑승가능")
else:    
    print("탑승불가능")


    
# 숫자3개 (정수)를 입력받고, 연산1개를 입력받아
# +++ --- ////(나누기값은 둘째자리까지 표현)
# ex)a + b + c =d 형태로 출력(1+2+3=6)
# 연산자가 -로 입력받으면 (1-2-3=-4)
#+++ --- ///(나누기값은 둘쨰자리까지 표현)
#숫자 3개로 계산기
A=int(input("첫번째 숫자  >>>  "))
B=int(input("두번째 숫자  >>>  "))
C=int(input("세번째 숫자  >>>  "))
D=input("연산을 선택 하세요 +,-,*,/ >>>  ")
if D == '+':
    print('{}+{}+{}={}'.format(A,B,C,A+B+C))
elif D == '-':
    print('{}-{}-{}={}'.format(A,B,C,A-B-C))
elif D == '-':
    print('{}*{}*{}={}'.format(A,B,C,A*B*C))
elif D == '/':
    print('{}/{}/{}={:.2f}'.format(A,B,C,A/B/C))       
else:
    print("잘못입력하였습니다.")
    
    
    
    
    
    


