# 두수를 입력받아, 두 수 사이의 합계를 구하시오.

#1. 두수를 입력
#2. 함수 호출
#3. 1,10 (1+2+3+4+%..10)
#4. 합계를 리턴 받아서
#5. 합계 : 55출력
#.1~10까지의 더하기,빼기, 곱하기의 결과값을 출력하세요.]
#파이썬 언어는 컴파일러(0,1로 ,빠르게 되지만 무거움)
#인터프리터 java(시간이 오래걸리지만 가벼움)

def cal(s_list):
    for i in range(s_list[0],s_list[1]+1):
        s_list[2]+=i
        s_list[3]-=i
        s_list[4]*=i

        
        
#다시해보기
a=int(input("첫번째 숫자를 입력해주세요 >>"))
b=int(input("두번째 숫자를 입력해주세요 >>"))
#함수호출(리스트를 이용해서)
s_list=[a,b,0,0,1]
cal(s_list)
print("더하기 값 :",s_list[2])
print("빼기 값 :",s_list[3])
print("곱하기 값 :",s_list[4])
print(s_list)
